test/k6/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6-load-test/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/40.0s

running (0m02.0s), 02/10 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  02.0s/40.0s

running (0m03.0s), 03/10 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  03.0s/40.0s

running (0m04.0s), 04/10 VUs, 6 complete and 0 interrupted iterations
default   [  10% ] 04/10 VUs  04.0s/40.0s

running (0m05.0s), 05/10 VUs, 10 complete and 0 interrupted iterations
default   [  12% ] 05/10 VUs  05.0s/40.0s

running (0m06.0s), 06/10 VUs, 15 complete and 0 interrupted iterations
default   [  15% ] 06/10 VUs  06.0s/40.0s

running (0m07.0s), 07/10 VUs, 21 complete and 0 interrupted iterations
default   [  17% ] 07/10 VUs  07.0s/40.0s

running (0m08.0s), 08/10 VUs, 28 complete and 0 interrupted iterations
default   [  20% ] 08/10 VUs  08.0s/40.0s

running (0m09.0s), 09/10 VUs, 36 complete and 0 interrupted iterations
default   [  22% ] 09/10 VUs  09.0s/40.0s

running (0m10.0s), 09/10 VUs, 45 complete and 0 interrupted iterations
default   [  25% ] 09/10 VUs  10.0s/40.0s

running (0m11.0s), 10/10 VUs, 53 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  11.0s/40.0s

running (0m12.0s), 10/10 VUs, 63 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  12.0s/40.0s

running (0m13.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  13.0s/40.0s

running (0m14.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  14.0s/40.0s

running (0m15.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  15.0s/40.0s

running (0m16.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  16.0s/40.0s

running (0m17.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  17.0s/40.0s

running (0m18.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  18.0s/40.0s

running (0m19.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  19.0s/40.0s

running (0m20.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  20.0s/40.0s

running (0m21.0s), 10/10 VUs, 146 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  21.0s/40.0s

running (0m22.0s), 10/10 VUs, 155 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  22.0s/40.0s

running (0m23.0s), 10/10 VUs, 165 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  23.0s/40.0s

running (0m24.0s), 10/10 VUs, 175 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  24.0s/40.0s

running (0m25.0s), 10/10 VUs, 185 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  25.0s/40.0s

running (0m26.0s), 10/10 VUs, 195 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  26.0s/40.0s

running (0m27.0s), 10/10 VUs, 205 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  27.0s/40.0s

running (0m28.0s), 10/10 VUs, 215 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  28.0s/40.0s

running (0m29.0s), 10/10 VUs, 225 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  29.0s/40.0s

running (0m30.0s), 10/10 VUs, 235 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  30.0s/40.0s

running (0m31.0s), 10/10 VUs, 244 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  31.0s/40.0s

running (0m32.0s), 09/10 VUs, 253 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  32.0s/40.0s

running (0m33.0s), 08/10 VUs, 261 complete and 0 interrupted iterations
default   [  82% ] 08/10 VUs  33.0s/40.0s

running (0m34.0s), 07/10 VUs, 269 complete and 0 interrupted iterations
default   [  85% ] 07/10 VUs  34.0s/40.0s

running (0m35.0s), 06/10 VUs, 275 complete and 0 interrupted iterations
default   [  87% ] 06/10 VUs  35.0s/40.0s

running (0m36.0s), 05/10 VUs, 281 complete and 0 interrupted iterations
default   [  90% ] 05/10 VUs  36.0s/40.0s

running (0m37.0s), 04/10 VUs, 286 complete and 0 interrupted iterations
default   [  92% ] 04/10 VUs  37.0s/40.0s

running (0m38.0s), 03/10 VUs, 289 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  38.0s/40.0s

running (0m39.0s), 02/10 VUs, 292 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  39.0s/40.0s

running (0m40.0s), 01/10 VUs, 294 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  40.0s/40.0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=49.68ms min=30.17ms med=48.02ms max=126.97ms p(90)=58.61ms p(95)=68.1ms
      { expected_response:true }...: avg=49.68ms min=30.17ms med=48.02ms max=126.97ms p(90)=58.61ms p(95)=68.1ms
    http_req_failed................: 0.00% 0 out of 295
    http_reqs......................: 295   7.352293/s

    EXECUTION
    iteration_duration.............: avg=1.05s   min=1.03s   med=1.05s   max=1.12s    p(90)=1.05s   p(95)=1.07s 
    iterations.....................: 295   7.352293/s
    vus............................: 1     min=1        max=10
    vus_max........................: 10    min=10       max=10

    NETWORK
    data_received..................: 16 MB 396 kB/s
    data_sent......................: 22 kB 537 B/s



running (0m40.1s), 00/10 VUs, 295 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  40s